tommyys/obdgauge/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
# 8MB embedded PSRAM, octal (esptool reports "Embedded PSRAM 8MB (AP_3v3)").
# Needed for the 466x466 framebuffer: ~424KB per frame.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# This board has no USB-to-UART bridge: the only link to the Mac is the
# ESP32-S3's native USB-Serial/JTAG. IDF defaults the console to UART0, whose
# pins go nowhere here, so printf output is invisible without this.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_CXX_EXCEPTIONS=n

# Fonts for the gauge readouts. LVGL ships none enabled by default beyond 14.
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# The backdrop benchmark deliberately spins without yielding; the idle-task
# watchdog otherwise fires once per measurement window and pollutes the timings.
CONFIG_ESP_TASK_WDT_INIT=n

# Real FPS from the display pipeline, so frame-rate questions are answered with
# a number rather than an opinion. Costs <2us per frame.
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FPS_STATS=y

# LVGL will not refresh more often than this, so the default 33ms pinned the UI
# at 30fps regardless of how cheap frames became.
CONFIG_LV_DEF_REFR_PERIOD=16

# lv_snapshot renders a view into a buffer of our own. The carousel slide needs
# two such buffers -- the outgoing and incoming views -- so that sliding costs a
# memcpy and a blit per frame instead of re-rendering both views ten bands at a
# time. Off by default in LVGL.
CONFIG_LV_USE_SNAPSHOT=y

# Waveshare's own examples for this board (examples/esp-idf/02_lvgl_demo_v9,
# 04_Immersive_block) build for speed; we were still on the IDF debug defaults.
# Measured on the board 2026-08-22: the 434 KB-per-frame flash read went
# 68ms -> 47ms (esp_partition_read) and 42ms -> 29ms (mmap+memcpy). The byte
# swap barely moved (13ms -> 12ms) -- it is PSRAM-bandwidth bound, not CPU
# bound -- and the blit 37ms -> 32ms is limited by the BSP's hardcoded 40 MHz
# panel QSPI clock, not by anything here.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# QIO doubles the flash data lines. IDF still writes "dio" into the image
# header for QIO (esptool_py/Kconfig.projbuild) and the 2nd-stage bootloader
# switches at runtime, so the flash command printing --flash_mode dio is
# expected and not a sign this failed.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# At the 100 Hz default tick, LV_DEF_REFR_PERIOD=16 rounds to 20ms, so the
# refresh cadence was uneven regardless of frame cost.
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
